---
kind: method
id: M:Autodesk.Revit.DB.CustomExporter.Dispose
source: html/2a3e9fca-a6a5-f0a4-4ebf-aeea322333ce.htm
---
# Autodesk.Revit.DB.CustomExporter.Dispose Method

Releases all resources used by the CustomExporter

## Syntax (C#)
```csharp
public void Dispose()
```